In [1]:
import pandas as pd
import numpy as np

In [2]:
jobs=pd.read_csv("jobs.csv")

In [3]:
jobs.head()

   Unnamed: 0                 emp_title
0           0                       NaN
1           1                     Ryder
2           2                       NaN
3           3       AIR RESOURCES BOARD
4           4  University Medical Group

In [5]:
jobs.fillna("other",inplace=True)

In [6]:
jobs.columns

Index(['Unnamed: 0', 'emp_title'], dtype='object')

In [7]:
jobs.drop(columns=['Unnamed: 0'],inplace=True)

In [8]:
jobs.emp_title=jobs.emp_title.str.lower()

In [9]:
jobs.head()

                  emp_title
0                     other
1                     ryder
2                     other
3       air resources board
4  university medical group

In [29]:
from sklearn.feature_extraction.text import TfidfVectorizer

In [32]:
tv=TfidfVectorizer()

In [33]:
jobs_list=list(jobs.emp_title)

In [34]:
x_tv=tv.fit_transform(jobs_list)

In [35]:
type(x_tv)

scipy.sparse.csr.csr_matrix

In [36]:
from sklearn.cluster import KMeans

In [37]:
km=KMeans(n_clusters=10)

In [38]:
km.fit(x_tv)

KMeans(n_clusters=10)

In [39]:
km.labels_

array([6, 0, 6, ..., 0, 0, 0])

In [40]:
jobs["labels"]=km.labels_

In [41]:
jobs.head()

                  emp_title  labels
0                     other       6
1                     ryder       0
2                     other       6
3       air resources board       0
4  university medical group       0

In [42]:
jobs.labels.value_counts()

0    620801
7     85799
6     51464
2     26904
8     23832
4     22681
3     18728
1     18170
9     14393
5      4607
Name: labels, dtype: int64

In [50]:
for i in range(10):
    print (jobs[jobs.labels==i].emp_title.value_counts().head(),i)

owner               8586
registered nurse    7721
rn                  6017
engineer            3186
president           3094
Name: emp_title, dtype: int64 0
teacher              16619
teacher                384
teacher/coach          310
teacher assistant      112
lead teacher           109
Name: emp_title, dtype: int64 1
director                  3427
executive director        1040
director of operations     957
managing director          488
director of sales          407
Name: emp_title, dtype: int64 2
supervisor                6937
supervisor                 560
production supervisor      422
maintenance supervisor     421
operations supervisor      342
Name: emp_title, dtype: int64 3
sales                   6208
sales manager           2713
sales associate          886
sales rep                716
sales representative     595
Name: emp_title, dtype: int64 4
district manager                       936
district sales manager                 191
los angeles unified school district     74
district manager                        66
clark county school district            59
Name: emp_title, dtype: int64 5
other    51464
Name: emp_title, dtype: int64 6
manager               14963
office manager         4687
project manager        4625
general manager        4256
operations manager     2591
Name: emp_title, dtype: int64 7
administrative assistant    2307
assistant manager           1830
executive assistant         1742
legal assistant              915
medical assistant            805
Name: emp_title, dtype: int64 8
driver             6215
truck driver       3566
bus driver          614
delivery driver     359
truck driver        228
Name: emp_title, dtype: int64 9

In [44]:
jobs[jobs.labels==7].emp_title.value_counts().head()

manager                         14963
office manager                   4687
project manager                  4625
general manager                  4256
operations manager               2591
                                ...
sr. manager, mfg                    1
engineer/project manager            1
credit dept manager                 1
sr. store operations manager        1
general manager/                    1
Name: emp_title, Length: 7751, dtype: int64

In [45]:
jobs[jobs.labels==0].emp_title.value_counts()

owner                              8586
registered nurse                   7721
rn                                 6017
engineer                           3186
president                          3094
                                   ...
justice                               1
topguy international trading          1
jakes steakhouse                      1
hill hospital                         1
manager hotel operations oasis        1
Name: emp_title, Length: 231956, dtype: int64